[
    {
        "img": "Undivided_Heart_Card.png",
        "name": "Undivided Heart",
        "cost_raw": "5 Cryo Dices",
        "cost": {
            "d_type": [
                "Cryo"
            ],
            "d_num": [
                5
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Ganyu, equip this card.\nAfter Ganyu equips this card, immediately use Frostflake Arrow once.\nWhen your Ganyu, who has this card equipped, uses Frostflake Arrow: Cryo DMG dealt by this Skill +1 if this Skill has been used before during this match, and it now deals 3 Piercing DMG to all opposing characters on standby instead.\n(You must have Ganyu in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Shaken,_Not_Purred_Card.png",
        "name": "Shaken, Not Purred",
        "cost_raw": "4 Cryo Dices",
        "cost": {
            "d_type": [
                "Cryo"
            ],
            "d_num": [
                4
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Diona, equip this card.\nAfter Diona equips this card, immediately use Icy Paws once.\nWhen your Diona, who has this card equipped, creates a Cat-Claw Shield, its Shield points +1.\n(You must have Diona in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Steady_Breathing_Card.png",
        "name": "Steady Breathing",
        "cost_raw": "4 Cryo Dices",
        "cost": {
            "d_type": [
                "Cryo"
            ],
            "d_num": [
                4
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Chongyun, equip this card.\nAfter Chongyun equips this card, immediately use Chonghua's Layered Frost once.\nWhen your Chongyun, who has this card equipped, creates a Chonghua Frost Field, it will have the following effects: Starting Duration (Rounds) +1, will cause your Sword, Claymore, and Polearm-wielding characters' Normal Attacks to deal +1 DMG.\n(You must have Chongyun in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Kanten_Senmyou_Blessing_Card.png",
        "name": "Kanten Senmyou Blessing",
        "cost_raw": "2 Cryo Dices",
        "cost": {
            "d_type": [
                "Cryo"
            ],
            "d_num": [
                2
            ],
            "p_num": 0
        },
        "des": "The Cryo Elemental Infusion created by your Kamisato Ayaka, who has this card equipped, allows the character to which it is attached to deal +1 Cryo DMG.\nWhen you switch to Kamisato Ayaka, who has this card equipped: Spend 1 less Elemental Die. (Once per Round)\n(You must have Kamisato Ayaka in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Glorious_Season_Card.png",
        "name": "Glorius Season",
        "cost_raw": "4 Hydro Dices",
        "cost": {
            "d_type": [
                "Hydro"
            ],
            "d_num": [
                4
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Barbara, equip this card.\nAfter Barbara equips this card, immediately use Let the Show Begin♪ once.\nWhen your Barbara, who has this card equipped, is on the field, Melody Loop will allow you to spend 1 less Elemental Die the next time you use \"Switch Character.\" (Once per round)\n(You must have Barbara in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Crossfire_Card.png",
        "name": "Crossfire",
        "cost_raw": "4 Pyro Dices",
        "cost": {
            "d_type": [
                "Pyro"
            ],
            "d_num": [
                4
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Xiangling, equip this card.\nAfter Xiangling equips this card, immediately use Guoba Attack once.\nWhen your Xiangling, who has this card equipped, uses Guoba Attack, she will also deal 1 Pyro DMG.\n(You must have Xiangling in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Grand_Expectation_Card.png",
        "name": "Grand Expectation",
        "cost_raw": "4 Pyro Dices and 2 Energy",
        "cost": {
            "d_type": [
                "Pyro"
            ],
            "d_num": [
                4
            ],
            "p_num": 2
        },
        "des": "Combat Action:  When your active character is Bennett, equip this card.\nAfter Bennett equips this card, immediately use Fantastic Voyage once.\nWhen your Bennett, who has this card equipped, creates an Inspiration Field, its DMG Bonus is now always active and will no longer have an HP restriction.\n(You must have Bennett in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Naganohara_Meteor_Swarm_Card.png",
        "name": "Naganohara Meteor Swarm",
        "cost_raw": "2 Pyro Dices",
        "cost": {
            "d_type": [
                "Pyro"
            ],
            "d_num": [
                2
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Yoimiya, equip this card.\nAfter Yoimiya equips this card, immediately use Niwabi Fire-Dance once.\nAfter your Yoimiya, who has this card equipped, triggers Niwabi Enshou: Deal 1 additional Pyro DMG.\n(You must have Yoimiya in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Stellar_Predator_Card.png",
        "name": "Stellar Predator",
        "cost_raw": "3 Electro Dices",
        "cost": {
            "d_type": [
                "Electro"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Fischl, equip this card.\nAfter Fischl equips this card, immediately use Nightrider once.\nWhen your Fischl, who has this card equipped, creates an Oz, and after Fischl uses a Normal Attack: Deal 2 Electro DMG. (Consumes Usage(s))\n(You must have Fischl in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Awakening_Card.png",
        "name": "Awakening",
        "cost_raw": "4 Electro Dices",
        "cost": {
            "d_type": [
                "Electro"
            ],
            "d_num": [
                4
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Razor, equip this card.\nAfter Razor equips this card, immediately use Claw and Thunder once.\nAfter your Razor, who has this card equipped, uses Claw and Thunder: 1 of your Electro characters gains 1 Energy. (Active Character prioritized)\n(You must have Razor in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Thundering_Penance_Card.png",
        "name": "Thundering Penance",
        "cost_raw": "3 Electro Dices",
        "cost": {
            "d_type": [
                "Electro"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Keqing, equip this card.\nAfter Keqing equips this card, immediately use Stellar Restoration once.\nWhen your Keqing, who has this card equipped, creates an Electro Elemental Infusion, it will have the following effects:\nStarting Duration (Rounds) +1, Electro DMG dealt by the attached character +1.\n(You must have Keqing in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Featherfall_Judgement_Card.png",
        "name": "Featherfall Judgement Card",
        "cost_raw": "3 Electro Dices",
        "cost": {
            "d_type": [
                "Electro"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Cyno, equip this card.\nAfter Cyno equips this card, immediately use Secret Rite: Chasmic Soulfarer once.\nWhen your Cyno, who has this card equipped, uses Secret Rite: Chasmic Soulfarer with 3 or 5 levels of Pactsworn Pathclearer's Indwelling effect, deal +1 additional DMG.\n(You must have Cyno in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Lands_of_Dandelion_Card.png",
        "name": "Lands of Dandelion",
        "cost_raw": "4 Anemo Dices and 3 Energy",
        "cost": {
            "d_type": [
                "Anemo"
            ],
            "d_num": [
                4
            ],
            "p_num": 3
        },
        "des": "Combat Action:  When your active character is Jean, equip this card.\nAfter Jean equips this card, immediately use Dandelion Breeze once.\nWhen your Jean, who has this card equipped, is on the field, Dandelion Field will cause you to deal +1 Anemo DMG.\n(You must have Jean in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Strategic_Reserve_Card.png",
        "name": "Strategic Reserve",
        "cost_raw": "4 Geo Dices",
        "cost": {
            "d_type": [
                "Geo"
            ],
            "d_num": [
                4
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Ningguang, equip this card.\nAfter Ningguang equips this card, immediately use Jade Screen once.\nWhen your Ningguang, who has this card equipped, is on the field, Jade Screen will cause you to deal +1 Geo DMG.\n(You must have Ningguang in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "I_Got_Your_Back_Card.png",
        "name": "I Got Your Back",
        "cost_raw": "3 Geo Dices",
        "cost": {
            "d_type": [
                "Geo"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Noelle, equip this card.\nAfter Noelle equips this card, immediately use Breastplate once.\nWhen your Noelle, who has this card equipped, creates a Full Plate, it will heal all your characters for 1 HP after Noelle uses a Normal Attack. (Once per Round)\n(You must have Noelle in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Floral_Sidewinder_Card.png",
        "name": "Floral Sidewinder",
        "cost_raw": "3 Dendro Dices",
        "cost": {
            "d_type": [
                "Dendro"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Collei, equip this card.\nAfter Collei equips this card, immediately use Floral Brush once.\nAfter your Collei, who has this card equipped, uses Floral Brush, during this Round, when your characters' Skills trigger Dendro-Related Reactions: Deal 1 Dendro DMG. (Once per Round)\n(You must have Collei in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Streaming_Surge_Card.png",
        "name": "Streaming Surge",
        "cost_raw": "4 Hydro Dices and 3 Energy",
        "cost": {
            "d_type": [
                "Hydro"
            ],
            "d_num": [
                4
            ],
            "p_num": 3
        },
        "des": "Combat Action:  When your active character is Rhodeia of Loch, equip this card.\nAfter Rhodeia of Loch equips this card, immediately use Tide and Torrent once.\nWhen your Rhodeia of Loch, who has this card equipped, uses Tide and Torrent, all of your Summon(s) gain +1 Usage(s).\n(You must have Rhodeia of Loch in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Mirror_Cage_Card.png",
        "name": "Mirror Cage",
        "cost_raw": "4 Hydro Dices",
        "cost": {
            "d_type": [
                "Hydro"
            ],
            "d_num": [
                4
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Mirror Maiden, equip this card.\nAfter Mirror Maiden equips this card, immediately use Influx Blast once.\nWhen your Mirror Maiden, who has this card equipped, creates a Refraction, it will have the following effects:\nStarting Duration (Rounds) +1, will increase the Elemental Dice Cost of switching from the character to which this is attached to another character by 1.\n(You must have Mirror Maiden in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Paid_in_Full_Card.png",
        "name": "Paid in Full",
        "cost_raw": "3 Pyro Dices",
        "cost": {
            "d_type": [
                "Pyro"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Fatui Pyro Agent, equip this card.\nAfter Fatui Pyro Agent equips this card, immediately use Prowl once.\nWhen your Fatui Pyro Agent, who has this card equipped, creates a Stealth, it will have the following effects:\nStarting Usage(s) +1, the Physical DMG the attached character deals will be converted to Pyro DMG.\n(You must have Fatui Pyro Agent in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Transcendent_Automaton_Card.png",
        "name": "Transcendent Automaton",
        "cost_raw": "3 Anemo Dices",
        "cost": {
            "d_type": [
                "Anemo"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Maguu Kenki, equip this card.\nAfter Maguu Kenki equips this card, immediately use Blustering Blade once.\nAfter your Maguu Kenki, who has this card equipped, uses Blustering Blade, you will switch to your next character. You will switch to your previous character when your Maguu Kenki, who has this card equipped, uses Frosty Assault.\n(You must have Maguu Kenki in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Stonehide_Reforged_Card.png",
        "name": "Stonehide Reforged",
        "cost_raw": "4 Geo Dices and 2 Energy",
        "cost": {
            "d_type": [
                "Geo"
            ],
            "d_num": [
                4
            ],
            "p_num": 2
        },
        "des": "Combat Action:  When your active character is Stonehide Lawachurl, equip this card.\nAfter Stonehide Lawachurl equips this card, immediately use Upa Shato once.\nWhen your Stonehide Lawachurl, who has this card equipped, defeats an opposing character: Stonehide Lawachurl will re-attach Stonehide and Stone Force.\n(You must have Stonehide Lawachurl in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Proliferating_Spores_Card.png",
        "name": "Proliferating Spores",
        "cost_raw": "3 Dendro Dices",
        "cost": {
            "d_type": [
                "Dendro"
            ],
            "d_num": [
                3
            ],
            "p_num": 0
        },
        "des": "Combat Action:  When your active character is Jadeplume Terrorshroom, equip this card.\nAfter Jadeplume Terrorshroom equips this card, immediately use Volatile Spore Cloud once.\nYour Jadeplume Terrorshroom, who has this card equipped, can accumulate 1 more stack of Radical Vitality.\n(You must have Jadeplume Terrorshroom in your deck to add this card to your deck.)",
        "tags": [],
        "type": ""
    },
    {
        "img": "Elemental_Resonance_Enduring_Rock.png",
        "name": "Elemental Resonance: Enduring Rock",
        "cost_raw": "1 Geo Dice",
        "cost": {
            "d_type": [
                "Geo"
            ],
            "d_num": [
                1
            ],
            "p_num": 0
        },
        "des": "During this round, after your character deals Geo DMG next time: Should there be any Combat Status on your side that provides Shield, grant one such Status with 3 Shield points.\n(You must have at least 2 Geo characters in your deck to add this card to your deck.)",
        "tags": [
            "elemental_resonance"
        ],
        "type": "event",
        "code_name": "elemental_resonance_enduring_rock"
    },
    {
        "img": "Elemental_Resonance_Sprawling_Greenery.png",
        "name": "Elemental Resonance: Sprawling Greenery",
        "cost_raw": "1 Dendro Dice",
        "cost": {
            "d_type": [
                "Dendro"
            ],
            "d_num": [
                1
            ],
            "p_num": 0
        },
        "des": "During this round, the next Elemental Reaction your active character triggers deals +2 DMG.\nYour Burning Flame, Dendro Core, and Catalyzing Field gain +1 Usage(s).\n(You must have at least 2 Dendro characters in your deck to add this card to your deck.)",
        "tags": [
            "elemental_resonance"
        ],
        "type": "event",
        "code_name": "elemental_resonance_sprawling_greenery"
    }
]